###############################################
#Sistema de ajuda do sistema
###############################################

###############################################
#Avaliacao - Maquina / Recurso / Tecido
###############################################
avaliacaoMaq_Grafico=Mostra sob a forma de gr\u00E1fico de barras a compara\u00E7\u00E3o entre necessidade e disponibilidade de m\u00E1quina no setor de costura, em minutos, para todos os periodos, considerando um plano especifico de produ\u00E7\u00E3o selecionado a priori. O usu\u00E1rio pode selecionar as vari\u00E1veis que deseja selecionar no gr\u00E1fico a partir do clique na check box dessas vari\u00E1veis no gr\u00E1fico. Isso \u00E9 v\u00E1lido para todos os gr\u00E1ficos no sistema.
avaliacaoMaq_Imprimir=Imprime sob forma de relatório com extensão .pdf o cadastro de análise de máquina.
avaliacaoMaq_SelecionarDisponibilidade=Permite a visualização da disponibilidade de máquina no setor de costura, em minutos, para todos os periodos ou a análise período à período a  partir da seleção do período, considerando um plano especifico de produção selecionado a priori.
avaliacaoMaq_SelecionarPeriodo=Permite a visualização da disponibilidade de máquina no setor de costura, em minutos, para um período, considerando um plano especifico de produção selecionado a priori.
avaliacaoMaq_SelecionarPlano=Permite a seleção do plano mestre para o qual o usuário deseja fazer a análise da capacidade de produção diária em minutos no setor de costura para a matriz.

avaliacaoRec_Grafico=Mostra sob a forma de gr\u00E1fico de barras a compara\u00E7\u00E3o entre necessidade e disponibilidade do recurso critico de producao, para todos os periodos, considerando um plano especifico de produ\u00E7\u00E3o selecionado a priori. A op\u00E7\u00E3o \u00E9 acessada a partir do bot\u00E3o 'Gr\u00E1fico' na tela de an\u00E1lise de capacidade de recurso. O usu\u00E1rio pode selecionar as vari\u00E1veis que deseja selecionar no gr\u00E1fico a partir do clique na check box dessas vari\u00E1veis no gr\u00E1fico. Isso \u00E9 v\u00E1lido para todos os gr\u00E1ficos no sistema.
avaliacaoRec_Imprimir=Imprime sob forma de relatório com extensão .pdf o cadastro de análise de recurso.
avaliacaoRec_SelecionarCapacidade=Permite a visualização da disponibilidade do recurso selecionado, para todos os períodos ou a análise período à período, considerando um plano específico de produção selecionado a priori.
avaliacaoRec_SelecionarDisponibilidade=Permite a selecao do plano mestre para qual se deseja fazer a analise de capacidade do recurso critico.
avaliacaoRec_SelecionarPeriodo=Permite a visualização da disponibilidade e necessidade do recurso crítico, para um período, considerando um plano específico de produção selecionado a priori.
avaliacaoRec_SelecionarPlano=Permite a seleção do plano mestre para o qual o usuário deseja fazer a análise do impacto de um plano de producao selecionado em cada recurso critico de producao.

avaliacaoTec_Grafico=Mostra sob a forma de gr\u00E1fico de barras a compara\u00E7\u00E3o entre necessidade e disponibilidade de tecido, em kilos, para todos os periodos, considerando um plano especifico de produ\u00E7\u00E3o selecionado a priori. A op\u00E7\u00E3o \u00E9 acessada a partir do bot\u00E3o 'Gr\u00E1fico' na tela de an\u00E1lise de capacidade de tecido. O usu\u00E1rio pode selecionar as vari\u00E1veis que deseja selecionar no gr\u00E1fico a partir do clique na check box dessas vari\u00E1veis no gr\u00E1fico. Isso \u00E9 v\u00E1lido para todos os gr\u00E1ficos no sistema.
avaliacaoTec_Imprimir=Imprime sob form de relatorio com extensão .pdf o cadastro de análise de tecido.
avaliacaoTec_SelecionarCapacidade=Permite a visualização da disponibilidade do tecido selecionado em kilos, para todos os períodos ou a análise período à período, considerando um plano específico de produção selecionado a priori.
avaliacaoTec_SelecionarDisponibilidade=Permite a seleção do tecido que se quer analisar a disponibilidade, considerando o plano selecionado inicialmente.
avaliacaoTec_SelecionarPeriodo=Permite a visualização da disponibilidade e necessidade do tecido em kilos, para um período, considerando um plano específico de produção selecionado a priori.
avaliacaoTec_SelecionarPlano=Permite a seleção do plano mestre para o qual o usuário deseja fazer a análise da disponibilidade de um determinado tecido considerando um plano específico de produção e a necessidade de tecido decorrente dele.

###############################################
#Avaliacao Fuzzy
###############################################
avaliacaoFuzzy_Cadastro=Esta tela tem como objetivo permitir a análise dos planos de produção definidos para cada modelo levando em consideração se os níveis de estoque estão compátiveis com a política de estoques estabelecida pela empresa.  Nesta tela são visualizados além dos dados cadastrais dos planos as seguintes informações:
	avaliacaoFuzzy_EscoreMedio=valor do escore m\u00E9dio obtido pelo plano considerando todos os seus modelos, ou seja,  informa a media das notas quanto a estoque para os planos de todos os modelos do plano sendo analisado.
	avaliacaoFuzzy_EscoreMinimo=que indica qual a pior avalia\u00E7\u00E3o (escore) obtida quanto a estoques dentre todos os per\u00EDodos de todos os modelos do plano analisado.
	avaliacaoFuzzy_VariacaoEstoque=varia\u00E7\u00E3o percentual de estoque (relacionando Estoque de seguran\u00E7a desejado - Disponibilidade Projetada) relativa ao per\u00EDodo x modelo que obteve escore m\u00EDnimo.
	avaliacaoFuzzy_VariacaoProducaoDiaria=varia\u00E7\u00E3o percentual da produ\u00E7\u00E3o di\u00E1ria do per\u00EDodo em rela\u00E7\u00E3o \u00E0 produ\u00E7\u00E3o di\u00E1ria m\u00E9dia, daquele modelo no plano sendo analisado.
	avaliacaoFuzzy_Ranking=Classifica\u00E7\u00E3o obtida pelo plano como um todo, considerando a avalia\u00E7\u00E3o deste e dos demais planos avaliados.  O ranking \u00E9 definido em fun\u00E7\u00E3o da ordena\u00E7\u00E3o do Escore M\u00E9dio obtido pelo plano do maior para o menor valor.\t
avaliacaoFuzzy_CalcularEscores=Calcula os escores do plano em rela\u00E7\u00E3o aos n\u00EDveis de estoque a partir da execu\u00E7\u00E3o do motor de infer\u00EAncia fuzzy e considerando a sele\u00E7\u00E3o a priori de um arquivo contendo uma modelagem fuzzy adequada para o procedimento de avalia\u00E7\u00E3o.  Na tela de sele\u00E7\u00E3o do arquivo de modelagem s\u00F3 aparecem listadas as modelagens cuja finalidade \u00E9 'AvaliarPMP'.  Op\u00E7\u00E3o acessada atrav\u00E9s do bot\u00E3o 'Calcular Escores na tela de Avalia\u00E7\u00E3o do PMP Fuzzy.
avaliacaoFuzzy_DetalharPlano=Permite analisar o desempenho do plano considerando seu detalhamento ao nível de modelo para verificar os valores que levaram a obtenção de um determinado escore por parte do plano.
avaliacaoFuzzy_Grafico=Permite visualizar o gráfico com a evolução das variáveis do plano de produção para um modelo pré-selecionado, considerando todos os períodos do horizonte de planejamento.

###############################################
#CadPlan
###############################################
cadPlan_Cadastro=Permite o gerenciamento do cadastro de planos mestres alternativos. Todos os planos cadastrados funcionam sobre o mesmo conjunto de períodos que são definidos na tela 'Definição do Horizonte de Planejamento'. São incluídos os Planos Mestres e os Planos Agregados são obitdos por totalização. Esta tela permite que acesso ao cadastro com todos os planos mestres incluidos no sistema por aquele usuário logado. Ou seja, cada usuário apenas acessa o seu conjunto de planos mestres.
cadPlan_CopiarPlano=Tem como objetivo facilitar o processo de simulação 'what if', na medida em que permite a cópia e posterior alteração de um plano já incluído. Desta forma o usuário pode testar algumas alternativas sem perder uma solução já obtida, e comparar os resultados obtidos antes de escolher qual o plano que mais atende aos critérios analisados. Na realidade funciona como uma inclusão de plano, porém aproveitando os valores de um outro plano já existente. O Plano Agregado relativo a este Plano Mestre é copiado simultaneamente. Para um dado plano selecionado o sistema mostra a janela de edição para que o usuário infome o código e descrição do novo plano, realiza uma verificação para saver se o código já existe, copia o conteúdo do plano mestre origem para o novo plano mestre que está sendo incluído e copia o conteúdo do plano agregado origem para o novo plano agregado.
cadPlan_Excluir=Este procedimento exclui todos os registros do Plano Mestre (arquivo PlPerMod) e do Plano Agregado relativos ao plano selecionado.
cadPlan_Implementar=Tem como objetivo permitir a atualização ou criação do Plano Vigente. Tanto a nível de Plano Mestre como de Plano Agregado. O plano mestre vigente é implementado a partir de um dos planos do cadastro de planos mestre que foi selecionado após uma análise sobre sua adequação aos recursos disponíveis e a demanda que se pretende atender. O plano agregado equivalente ao plano mestre selecionado é implementado simultaneamente.
cadPlan_Imprimir=Imprime sob a forma de relat\u00F3rio com extens\u00E3o .pdf o plano mestre de produ\u00E7\u00E3o por modelo. 
cadPlan_Incluir=Esta opção tem como objetivo permitir a inclusão do PMP (Plano Mestre de Produção) baseado na Equação de Conservação de Estoque e usando os dados do Cadastro de Modelos e de demanda na tabela relativa a demanda por família e por período. Os modelos que tiverem o campo Status = fixo vão aproveitar inteiramente o campo ProduçãoModel do Plano Vigente. Ou seja, gera um plano de produção e respectivos valores para Disponibilidade Projetada e Cobertura % de estoques empregando a equação de conservação de estoques e levando em consideração se a produção para cada período é ainda sujeita a mudança ou se já é considerada uma Ordem Firme Planejada. Antes de alterar o valor do campo Produção do Modelo verifica se o campo Status é igual a livre ou fixo. Se for livre propõe então o novo valor, caso contrário mantém o mesmo valor existente para produção e recalcula os demais em função disto.
cadPlan_IncluirPMPFuzzy=Permite a inclusão de um plano mestre de produção a partir de um arquivo com extensão .xfl que contém o mecanismo de inferência fuzzy. O arquivo deve ter sido previamente cadastrado no 'Cadastro de Modelagens Fuzzy' alternativas do 'Módulo de Engenharia de Conhecimento'. Após a informação do código e descrição do plano o usuário deve selecionar a modelagem fuzzy que pretende utilizar na combo box adequada. Só aparecem como modelagens fuzzy disponíveis para incluir o PMP aqueles arquivos .xfl devidamente cadastrados no módulo de Engenharia de Conhecimento que possuem a finalidade 'Incluir PMP'. Caso o arquivo de modelagem tenha algum erro o sistema mostrará a mensagem indicando. Na tela resultante aparece o campo modelagem que informa ao usuário qual o arquivo de modelagem fuzzy foi empregado para gerar este plano.
cadPlan_Mostrar=Permite visualizar dados cadastrais do plano e é acessado ao clicar no link de código na tela de cadastro.
cadPlan_TotalizarPlanos=Permite visualizar os dados de Vendas, Produção e Disponibilidade do plano mestre selecionado em termos de valores totalizados para todos os modelos, por período. No caso da Cobertura de Estoque é calculada a cobertura média dos modelos por período.

###############################################
#CapacDia
###############################################
capacDia_Cadastro=Permite informar a capacidade de produção diária em minutos do setor de costura na matriz. Os registros relativos aos períodos da tabela CapacDia são incluídos no momento em que o usuário aciona a ação 'Inicia Planejamento' na tela 'Configura Horizonte de Planejamento'.
capacDia_Editar=Torna editável o campo 'Capacidade de Produção Diária' em minutos do período e calcula automaticamente o campo de 'Capacidade de Produção Diária' com margem de segurança.
capacDia_EditarCapacPadrao=Esta opção permite que se informe um valor para o campo 'Capacidade de Produção Diária' em minutos de costura que será copiado automaticamente para todos os períodos, porque na maioria das vezes a Capacidade Diária é a mesma para todos os períodos.
capacDia_EditarMargemSeguranca=Permite editar o campo Margem de Seguran\u00E7a percentual. \u00C9 acessado a partir do bot\u00E3o 'Alterar' que aparece ao lado do campo Margem de Seguran\u00E7a na tela de Capacidade de Produ\u00E7\u00E3o Di\u00E1ria.

###############################################
#CapacRec
###############################################
capacRec_Cadastro=Lista para todos os períodos do horizonte de planejamento a capacidade diária do recurso selecionado.
capacRec_Editar=Permite editar o campo capacidade diária do recurso no período selecionado.
capacRec_EditarCapacPadrao=Permite editar o campo capacidade diária do recurso no período selecionado.

###############################################
#CapacTecView
###############################################
capacTecView_Cadastro=Informa para cada período do Horizonte de Planejamento a disponibilidade diária máxima para aquele tecido na matriz.

###############################################
#DeFamPer
###############################################
deFamPer_Agregar=Permite totalizar a demanda de todos os modelos de cada família, agregando também as demandas do períodos do plano mestre para formar os períodos do plano agregado.
deFamPer_Cadastro=Permite gerenciar o cadastro com informações de pedidos cadastrados e vendas projetadas de cada família em cada período do horizonte de planejamento. Uma vez selecionada a família aparece listado na tela as informações de demanda para todo horizonte de planejamento. Os períodos usados na demanda da família são os períodos do plano agregado.
deFamPer_Editar=Permite a edição de venda projetada e pedido da família e período selecionados.
deFamPer_Grafico=Para a família selecionada permite visualizar um gráfico com vendas projetadas e pedidos cadastrados dessa família, para todo horizonte de planejamento. O usuário pode selecionar as variáveis que deseja selecionar no gráfico a partir do clique na check box dessas variáveis no gráfico. Isso é válido para todos os gráficos no sistema.

###############################################
#DeModPer
###############################################
deModPer_Cadastro=Permite gerenciar o cadastro com informa\u00E7\u00F5es de pedidos cadastrados e vendas projetadas de cada modelo em cada per\u00EDodo de horizonte de planejamento. Uma vez selecionado o modelo aparece listado na tela as informa\u00E7\u00F5es de demanda para todo Horizonte de Planejamento. 
deModPer_Editar=Permite a edição de venda projetada e pedido para o período selecionado.
deModPer_Grafico=Para o modelo selecionado permite visualizar um gráfico com vendas projetadas e pedidos desse modelo, para todo horizonte de planejamento. O usuário pode selecionar as variáveis que deseja selecionar no gráfico a partir do clique na check box dessas variáveis no gráfico. Isso é válido para todos os gráficos no sistema.

###############################################
#Excecao
###############################################
excecao_Cadastro=Esta tela permite ao gestor selecionar para um dado plano mestre quais as mensagens de exceção que serão assinaladas como ativas. Uma vez definido o plano mestre, o planejador deve avaliá-lo em relação a alguns fatores. A análise das mensagens de exceção tem como finalidade facilitar esta tarefa, chamando a atenção para alguns aspectos que estariam fora dos padrões desejados. Na tela de cadastro de planos o gestor pode solicitar que sejam geradas as mensagens de exceção para o plano em particular. O sistema vai gerar as mensagens apenas para as exceções assinaladas como ativas.
excecao_MudarStatusGeral=Permite a mudança de status de ativo/desativo para todas as mensagens
excecao_MudarStatus=Permite a mudança de status de ativo/desativo para uma exceção em particular

###############################################
#ExcecaoMens
###############################################
excecaoMens_GerarExcecao=Gera as mensagens de exceção para aquelas exceções assinaladas como ativas e permite visualizar cada uma das exceções para cada um dos modelos no plano selecionado. Cada vez que o usuário selecionar esta opção o conjunto de exceções gerado anteriormente é apagado e são gravadas as novas exceções.
excecaoMens_MostrarExcecao=Permite visualizar cada uma das exceções para cada um dos modelos no plano selecionado que foram geradas através da opção 'Gerar Exceção'.

###############################################
#Familia
###############################################
familia_Buscar=Permite localiza\u00E7\u00E3o e visualiza\u00E7\u00E3o da fam\u00EDlia ou fam\u00EDlias de acordo com a busca realizada por c\u00F3digo ou descri\u00E7\u00E3o. Para utilizar esta op\u00E7\u00E3o basta informar o c\u00F3digo ou descri\u00E7\u00E3o desejados na caixa de di\u00E1logo e clicar no bot\u00E3o 'Buscar'.
familia_Cadastro=Esta tela tem como objetivo gerenciar o cadastramento de famílias de produtos.
familia_Editar=Torna editáveis os campos: Descrição, Cobertura, Estoque Inicial e TMUC (Tempo Médio Unitário de Costura).
familia_Excluir=Permite exclusão da família de produtos selecionada. Para acessar a opção clicar no botão Excluir na tela de cadastro.
familia_Imprimir=Imprime sob a forma de relatório com extensão .pdf o cadastro de família.
familia_ImprimirFamiliaComModelo=Imprime sob a forma de relatório com extensão .pdf o cadastro de família com seus modelos.
familia_Incluir=Permite a inclusão de família no cadastro de famílias. As famílias devem ser incluídas de preferência no intervalo dos ciclos de planejamento. A cada inclusão de família deve-se incluir os registros equivalentes na tabela relativa a demanda por família e por período, considerando o número de meses desejado por família e os períodos do PMP.
familia_Mostrar=Permite mostrar os dados da família.

###############################################
#HP
###############################################
hp_AlterarTempoCongelado=Esta op\u00E7\u00E3o tem como objetivo implementar o conceito de intervalos de tempo congelados que visam permitir maior estabilidade ao PMP.  O valor estabelecido aqui pelo usu\u00E1rio como o n\u00FAmero de per\u00EDodos desejado,  ser\u00E1 usado para tornar o campo FlagProducaoModel \= fixo para todos os per\u00EDodos do plano contidos neste intervalo no momento da inclus\u00E3o do plano.  Ou seja, se for indicado 3, os tr\u00EAs primeiros per\u00EDodos ser\u00E3o considerados fixos, e quaisquer altera\u00E7\u00F5es consequentes de modifica\u00E7\u00E3o realizada em outros par\u00E2metros n\u00E3o afetar\u00E1 automaticamente a produ\u00E7\u00E3o definida como sendo fixa. Torna edit\u00E1vel o campo N\u00FAmero de Per\u00EDodos congelados. Grava esta informa\u00E7\u00E3o no arquivo 'Parametro' e mostra em tela.
hp_Cadastro=Tela responsável pela gestão de cadastro de horizonte de planejamento. A cada novo ciclo o usuário deve atualizar os períodos finais do horizonte de planejamento.
hp_Editar=Tem como objetivo a configura\u00E7\u00E3o dos per\u00EDodos limites do horizonte de planejamento do Plano Mestre. S\u00E3o necess\u00E1rios dois limites para o PAP e o outros dois para o PMP, isto porque, a n\u00E3o ser excepcionalmente, o n\u00FAmero de per\u00EDodos no PMP e no PAP s\u00E3o diferentes.  O per\u00EDodo inicial do PMP determina o per\u00EDodo inicial do PAP e do horizonte de planejamento da Demanda mas os per\u00EDodos finais s\u00E3o independentes, pois dependem da forma como foi agrupado o per\u00EDodo PAP, por\u00E9m as datas finais s\u00E3o iguais. Estas op\u00E7\u00F5es alteram o valor do campo InicPlanejamento do arquivo Parametro para NaoInicializado, o que vai impedir que o usu\u00E1rio fa\u00E7a inclus\u00E3o de modelos, fam\u00EDlias, recursos, planos e etc, sem que antes acione a fun\u00E7\u00E3o IniciaPlanejamento na tela 'Configura Horizonte de Planejamento'. Isto \u00E9 necess\u00E1rio porque estas op\u00E7\u00F5es podem modificar os per\u00EDodos e \u00E9 necess\u00E1rio que esta modifica\u00E7\u00E3o seja feita tamb\u00E9m nos demais arquivos que dependem dos per\u00EDodos. Qualquer uma destas op\u00E7\u00F5es exige  que tenha per\u00EDodo cadastrado. Os valores 'default' para todos os per\u00EDodos iniciais e finais de horizonte de planejamento tanto no PMP como no PAP e para demanda por modelo e demanda por fam\u00EDlia s\u00E3o os per\u00EDodos iniciais dos respectivos cadastros. N\u00E3o permite per\u00EDodo final anterior ao per\u00EDodo inicial. Cr\u00EDtica a edi\u00E7\u00E3o para que os campos referentes ao Per\u00EDodo tanto no horizonte de planejamento do PMP quanto no PAP perten\u00E7am ao intervalo dos Per\u00EDodos cadastrados no PAP e PMP.
hp_IniciarPlanejamento=Esta op\u00E7\u00E3o executa uma s\u00E9rie de procedimentos que visam atualizar os arquivos que s\u00E3o guiados pelos per\u00EDodos definidos no sistema, com os novos per\u00EDodos modificados pelo usu\u00E1rio. S\u00E3o atualizados os arquivos\: DeModPer, DeFamPer, CapacDia e CapacRec, e s\u00E3o reinstalados os arquivos CadPlan, PlPerMod, PlanoModelo e PlPerFam (este \u00FAltimo, apenas na pr\u00F3xima vers\u00E3o do sistema) porque ao iniciar um novo ciclo de planejamento n\u00E3o tem sentido deixar os planos cadastrados usados para gerar os Planos Vigentes do ciclo de planejamento anterior. Uma vez acionada esta op\u00E7\u00E3o \u00E9 alterado o flag InicPlanejamento do arquivo 'Parametro' para Inicializado.  Isto \u00E9 necess\u00E1rio para impedir o usu\u00E1rio de fazer algumas opera\u00E7\u00F5es com os arquivos relacionados com os per\u00EDodos alterados sem que estes estejam compat\u00EDveis com os novos arquivos de per\u00EDodo. N\u00E3o \u00E9 permitida inclus\u00E3o de Tecido ou recurso cr\u00EDtico ou Plano, ou Modelo ou Familia sem que o usu\u00E1rio tenha acionado antes a op\u00E7\u00E3o IniciaPlanejamento, ou seja, verifica se valor do campo InicPlanejamento do arquivo Parametro \u00E9 igual a 'Inicializado'. O intervalo de tempo referente a todo o horizonte de planejamento do Plano Mestre deve ser equivalente ao intervalo de tempo do horizonte de planejamento do PAP. Ao final da execu\u00E7\u00E3o desse m\u00E9todo, aparece na tela modificado o campo status do planejamento, que assume o valor 'Planejamento iniciado'.

###############################################
#Mensagens Globais (Observações)
###############################################
observacao_AcessoOutrosHelp=As demais opções de menu não listadas aqui, possuem função de help em tela própria.
observacao_AlertaPadrao=Observação:

###############################################
#Modelagem Fuzzy
###############################################
modelagemFuzzy_Cadastro=Esta tela tem como objetivo o cadastramento das modelagens fuzzy que serão usadas no sistema tanto na atividade de geração do plano mestre como para avaliação do plano quanto ao seu aspecto de politica de estoques.
modelagemFuzzy_DetalharModelagem=Permite visualizar os diversos conteúdos relativos a um item do cadastro de modelagem, tais como, operadores fuzzy, universo do discurso, variáveis lingüísticas, regras e gráficos com as partições fuzzy das variáveis.  Opção acessada ao clicar no link do Código no Cadastro de Modelagens. As informações cadastrais da modelagem aparecem no panel superior e as informações relativas a opção que se deseja visualizar aparecem no panel inferior.
modelagemFuzzy_Editar=Permite edição descrição da modelagem fuzzy selecionada.
modelagemFuzzy_Excluir=Permite excluir a modelagem do cadastro de modelagens juntamente com a exclus\u00E3o do arquivo xfl correspondente do servidor da aplica\u00E7\u00E3o. 
modelagemFuzzy_Grafico3D=Esta tela permite visualizar o gráfico com a superfície formada pela relação definida pelas variáveis lingüísticas, regras fuzzy e mecanismo de inferência para uma dada modelagem selecionada. Seu funcionamento está restrito a modelagens com três variáveis.
modelagemFuzzy_GraficoMF=Permite visualizar os gráficos com as variáveis  lingüísticas e suas respectivas partições fuzzy definidas   no arquivo .xfl associado a esse item do cadastro de modelagens selecionado.
modelagemFuzzy_Incluir=Permite o cadastramento do arquivo de modelagem. Esta inclus\u00E3o \u00E9 feita em 3 passos\: Primeiramente o usu\u00E1rio informa os dados cadastrais da modelagem, tais como c\u00F3digo, descri\u00E7\u00E3o e finalidade.  O campo finalidade indica qual a utiliza\u00E7\u00E3o do arquivo de modelagem, que pode ser 'Gerar PMP' ou 'Avaliar PMP' dependendo de qual ser\u00E1 sua utiliza\u00E7\u00E3o no sistema .  Ao clicar no bot\u00E3o 'Fazer Upload' o usu\u00E1rio inicia o segundo est\u00E1gio; O segundo passo consiste em acessar a tela onde ser\u00E1 feita a opera\u00E7\u00E3o de upload do arquivo de modelagem. Ao clicar no bot\u00E3o 'Add'  o usu\u00E1rio abre a caixa de di\u00E1logo para sele\u00E7\u00E3o de arquivo, que depois \u00E9 mostrado na tela. E por \u00FAltimo, para fazer o envio do arquivo selecionado para o servidor  deve clicar no bot\u00E3o 'Upload'.
modelagemFuzzy_MF=Permite visualizar as variáveis  lingüísticas e suas respectivas partições fuzzy definidas no arquivo .xfl associado a esse item do cadastro de modelagens selecionado.
modelagemFuzzy_Monitor=Esta tela permite monitorar o grau de ativa\u00E7\u00E3o das regras considerando a modelagem selecionada e o valor dos dados de entrada fornecidos para as vari\u00E1veis ling\u00FC\u00EDsticas. O usu\u00E1rio edita os valores desejados nos campos relativos a cada uma das vari\u00E1veis de entrada. Os valores oferecidos como default correspondem \u00E0s m\u00E9dias das respectivas vari\u00E1veis. 
	modelagemFuzzy_ExecutarMonitor=Tendo definido os valores das variáveis de entrada a priori, ao clicar no 'Executar Monitor' o sistema vai gerar um gráfico informando o conjunto nebuloso resultante do mecanismo de inferência destacando o defuzzyficado com uma linha azul. É mostrado simultaneamente o valor relativo ao grau de ativação de cada regra. O XFuzzy inicia a numeração das regras a partir de zero.
modelagemFuzzy_MostrarLimites=Permite visualizar o Universo do Discurso e a cardinalidade de cada variável lingüística contida   no arquivo .xfl associado a esse item do cadastro de modelagens selecionado.
modelagemFuzzy_MostrarModelagem=Permite visualizar o conteúdo completo do arquivo .xfl associado a esse item do cadastro de modelagens selecionado.
modelagemFuzzy_MostrarOperadores=Permite visualizar os operadores fuzzy configurados  no arquivo .xfl associado a esse item do cadastro de modelagens selecionado.
modelagemFuzzy_MostrarRegras=Permite visualizar as regras contidas no arquivo .xfl associado a esse item do cadastro de modelagens selecionado.
modelagemFuzzy_PreparaSimulador2D=Esta tela permite visualizar o gráfico relacionando um par - variável de entrada X variável de saída - para uma dada modelagem selecionada e considerando um valor fixo para a variável que não está sendo analisada.
modelagemFuzzy_Simulador2D=Uma vez que o usuário tenha editado o valor para a variável fixa ao clicar no 'Executar Simulador 2D' será mostrado o gráfico relacionando o par variável de entrada X variável de saída selecionado. O valor default para a variável fixa é o valor médio daquela variável. Esta tela funciona corretamente mesmo para modelagens com mais de uma variável de saída.

###############################################
#Modelo
###############################################
modelo_Buscar=Permite localização e visualização do modelo ou modelos de acordo com a busca realizada por código ou descrição. Para utilizar esta opção basta informar o código ou descrição desejados na caixa de diálogo e clicar no botão 'Buscar'.
modelo_Cadastro=Esta tela tem como objetivo gerenciar o cadastramento de modelos (produtos acabados).
modelo_CalcularPlano=Ao clicar no botão verifica se existe um plano mestre vigente e se tiver atualiza o valor do estoque em falta do modelo usando a quantidade que aparece negativa no campo de disponibilidade projetada relativo ao primeiro período do plano vigente. É apenas um valor default, mas pode ser editado pelo usuário.
modelo_DataRelativa=É a data a que se refere o estoque inicial informado (não é a data de atualização deste dado no sistema).
modelo_Editar=Permite alterações nos campos do registro do cadastro de modelos.
modelo_Excluir=Permite exclusão do modelo (produto acabado)  selecionado.  Para acessar a opção clicar no botão Excluir na tela de cadastro.
modelo_Imprimir=Imprime sob a forma de relatório com extensão .pdf o cadastro de modelos.
modelo_Incluir=Permite a inclusão de modelos no cadastro de modelos.
modelo_Mostrar=Permite mostrar os dados do modelo.

###############################################
#PerioPAP
###############################################
perioPAP_AgruparPeriodos=Usa o valor informado pelo usuário para funcionar como agregador dos Períodos do PM em relação aos períodos do PAP.  Ou seja, vai agrupar períodos do plano mestre para formar  períodos do plano agregado de acordo com o fator informado pelo usuário.  Por exemplo, podemos usar os períodos do PAP mensais e conectando-os a períodos semanais de PMP. Exclui os Períodos PAP originais  que ficarem sem PerioPM relacionados com estes depois da operação de agrupar.
perioPAP_Cadastro=Tela onde o usu\u00E1rio deve definir de que forma  v\u00E3o se organizar os per\u00EDodos ao n\u00EDvel do PAP.  Permite que os per\u00EDodos sejam definidos livremente , inclusive com intervalos diferentes para possibilitar que se trabalhe com per\u00EDodos mais detalhados no in\u00EDcio do horizonte de planejamento e mais agregados no fim. Os per\u00EDodos do PAP s\u00E3o definidos a partir da informa\u00E7\u00E3o por parte dos usu\u00E1rios dos per\u00EDodos PMP. \u00C9 sempre automaticamente mantida a equival\u00EAncia integral entre PeriodoPM e PeriodoPAP. Observa\u00E7\u00E3o\: Qualquer uma das op\u00E7\u00F5es desta tela altera o valor do campo InicPlanejamento do arquivo Parametro para NaoInicializado, o que vai impedir que o usu\u00E1rio fa\u00E7a inclus\u00E3o de modelos, fam\u00EDlias, recursos, planos e etc, sem que antes acione a fun\u00E7\u00E3o IniciaPlanejamento na tela 'Altera\u00E7\u00E3o dos limites do horizonte de planejamento'.  Isto \u00E9 necess\u00E1rio porque estas op\u00E7\u00F5es podem modificar os per\u00EDodos e \u00E9 necess\u00E1rio que esta modifica\u00E7\u00E3o seja feita tamb\u00E9m nos demais arquivos que dependem dos per\u00EDodos.
perioPAP_Editar=Permite alteração de cada Período PAP a partir da informação do Periodo PM que o iniciará e terminará. Não permite alteração se não houver Período PM cadastrado. Ao fim da inclusão em lista faz uma série de críticas aos PeríodoPM limites de cada PeríodoPAP, são elas, não permitir que PeríodoPMFinal seja menor que PeríodoPMInicial, não permitir que PeríodoPMFinal ou PeríodoPMInicial sejam nulos, exigir que todos os PeríodosPM sejam relacionados com algum PeríodoPAP e que cada PeríodoPM só possa estar relacionado a um PeríodoPAP. Estes dois últimos estão garantidos porque será calculado automaticamente o PeríodoPMInicial em função do PeríodoPMFinal.
perioPAP_Mostrar=Permite mostrar os dados do período do plano agregado.
perioPAP_ReinicializaPeriodos=Inicializa os períodos PAP fazendo-os iguais aos PeríodoPM . Não permite se não houver período cadastrado.

###############################################
#PerioPM
###############################################
perioPM_Cadastro=Tela onde o usuário deve definir de que forma  vão se organizar os períodos ao nível do PMP.  Permite que os períodos sejam definidos livremente, inclusive com intervalos diferentes para permitir que se trabalhe com períodos mais detalhados no início do horizonte de planejamento e mais agregados no fim. Só deve ser permitida edição através das opções específicas, devido às críticas e integridade com os outros arquivos relacionados. A criação dos Períodos do Plano Mestre deve ser a 1ª atividade de cada ciclo do planejamento.  Seguida pela arrumação dos PAPs e pela definição do horizonte de planejamento.
perioPM_Editar=Torna editáveis apenas os campos referentes e os números de dias úteis. Não permite inclusão ou exclusão de períodos. ?????????????
perioPM_ExcluirPrimeiro=Exclui o primeiro período do arquivo de períodos e renumera os demais. Também atualiza as entidades dependentes.  Opção que deve ser usada a cada novo ciclo de planejamento.
perioPM_ExcluirTodos=Permite exclusão simultânea de todos os periodos do PMP.
perioPM_ExcluirUltimo=Permite exclusão do registro referente ao último período. E atualiza as entidades dependentes.
perioPM_IncluirUltimo=Permite a inclusão de um período no fim do cadastro. Essa opção visa facilitar o reinício do ciclo e planejamento, quando provavelmente será apenas incluído um período ao fim dos que já existem e provavelmente excluído o primeiro deles. Antes de gravar em arquivo o período editado em tela, exige que os períodos sejam consecutivos tanto no que se refere a numeração quanto às datas, não permite que as datas de diferentes períodos tenham interseção e não permite que a data final de um período seja anterior a data inicial do mesmo. Inclui um PerioPAP relativo ao novo PerioPM, em seguida altera o parametro InicPlanejamento para Falso e salva o PerioPM em arquivo.
perioPM_Mostrar=Permite mostrar os dados do período.

###############################################
#PlPerMod
###############################################
plPerMod_Cadastro=Mostrar o detalhamento do plano mestre escolhido para cada um dos modelos, permite que sejam feitas edições em diversos parâmetros e recalcula automaticamente, de acordo com a equação de conservação de estoques os parâmetros restantes.
plPerMod_EditarCobertura=Torna edit\u00E1vel o campo Cobertura % de Estoques e recalcula os demais em fun\u00E7\u00E3o disso.\t\t
plPerMod_EditarDisponibilidade=Torna editável o campo Disponibilidade Projetada e recalcula os demais em função disso.
plPerMod_EditarPedidos=Torna editável o campo Pedidos e recalcula os demais em função disso. Sua utilização tem o mesmo objetivo que a de edição das vendas projetadas.
plPerMod_EditarProducao=Torna editável o campo Produção em Lotes no período e recalcula os demais em função disso.
plPerMod_EditarProducaoDiaria=Torna editável o campo Produção Diária em Lotes no período e recalcula os demais em função disso.
plPerMod_EditarRecebimento=Torna editável o campo Recebimento de Produção e recalcula os demais em função disso.
plPerMod_EditarStatus=Alterna entre o status 'livre' e 'fixo' ao clicar no link do Status para cada período. Permite que o usuário assinale quais os períodos em que o valor do campo Produção do Modelo não deve ser alterado automaticamente pela equação de conservação de estoques. Seu funcionamento seria parecido ao das Ordens Firmes Planejadas.
plPerMod_EditarVendas=Torna editável o campo vendas Projetadas e recalcula os demais em função disso. Esta opção tem como objetivo permitir que seja verificado o efeito de alterações no nível de demanda no plano de produção, facilitando assim as negociações entre os departamentos de Marketing e Produção.  As alterações feitas aqui não alteram o arquivo relativo  ao plano de vendas, apenas as vendas projetadas e os pedidos relativos ao plano analisado.  A atualização nos arquivos relativos ao plano de vendas efetivo, deverão ser feitas através da edição por parte do usuário dos campos que foram alterados diretamente naquele cadastro.
plPerMod_Grafico=Permite visualizar em gráfico as informações do plano mestre de um modelo selecionado, relativas a demanda, produção em peças e disponibilidade projetada para cada período.
plPerMod_Imprimir=Imprime sob forma de relat\u00F3rio com extens\u00E3o .pdf o cadastro de plano mestre de produ\u00E7\u00E3o para todos os modelos. O mesmo relat\u00F3rio tamb\u00E9m pode ser acessado atrav\u00E9s da op\u00E7\u00E3o do menu 'Imprimir Todos' no Cadastro de planos.
plPerMod_MudarStatus=Para um modelo selecionado, inverte o valor do campo Status do Modelo de false para true ou vice-versa.  True equivale a 'planejado' e false equivale a 'n\u00E3o planejado'. Uma vez analisado e definido o plano para um modelo o usu\u00E1rio deve assinalar o modelo como 'Planejado' para seu pr\u00F3prio controle.  Quando for executada a fun\u00E7\u00E3o de implementa\u00E7\u00E3o do plano o sistema vai verificar se todos os modelos foram planejados e s\u00F3 permitir\u00E1 a implementa\u00E7\u00E3o neste caso. Op\u00E7\u00E3o acessada ao clicar no bot\u00E3o 'Mudar Status' na tela de Ajuste do Plano Mestre.
plPerMod_MudarStatusGeral=Muda, para todos os modelos, o valor do campo Status do Modelo para 'Planejado'. True equivale a 'planejado' e false equivale a 'não planejado'. Uma vez analisado e definido o plano para um modelo o usuário deve assinalar o modelo como 'Planejado' para seu próprio controle. Quando for executada a função de implementação do plano o sistema vai verificar se todos os modelos foram planejados e só permitirá a implementação neste caso. Também é possível fazer esta mudança de Status de modelo a modelo, através do botão 'Mudar Status' na tela de Ajuste do Plano Mestre.
plPerMod_ValoresAtuais=Permite visualizar os valores atuais existentes no cadastro de modelos.  Na tela do cadastro de planos \u00E9 mostrado o valor dos par\u00E2metros do modelo que foram usados no momento da inclus\u00E3o do plano.  Para acessar a op\u00E7\u00E3o clicar no bot\u00E3o 'Valores Atuais'.

###############################################
#Pmp
###############################################
pmp_Cadastro=Permite visualizar os registros do Plano Mestre Vigente gerado a partir de um plano selecionado e implementado a priori.
pmp_CalculoDiscreto=Cálculo para Disponibilidade de Entrega Discreta:
pmp_CalculoCritica1= 1 - Para o primeiro período, a disponibilidade de entrega é a soma do inventário inicial mais o PMP (Plano Mestre de Produção) para o mesmo período menos os Pedidos em Carteira para este período mais todos os períodos subsequentes até o período anterior em que houver o próximo recebimento do PMP.
pmp_CalculoCritica2= 2 - Para todos os períodos do primeiro, existem duas possibilidades: a) Se uma quantidade PMP tiver sido programada para o período, a disponibilidade de entrega será igual a quantidade programada menos a quantidade de Pedidos em Carteira para todos os períodos a partir deste e até o período anterior aquele para o qual foi programado o próximo recebimento PMP. b) Se nenhuma quantidade tiver sido programada para o período a disponibilidade de entrega é zero, mesmo que tenham sido prometidas entregas para este período.
pmp_DescricaoSiglas= Onde: DE = Disponibilidade de Entrega; PMP = Quantidade programada para recebimento no plano mestre; EI = Estoque Inicial; n = Próximo período no qual ocorrem recebimento de quantidades planejadas no PMP.

###############################################
#Recmodel
###############################################
recModel_Cadastro=Permite visualizar/gerenciar a lista de modelos que usam determinado recurso.
recModel_Editar=Permite editar o consumo unitário do recurso por aquele modelo.
recModel_Excluir=Permite excluir da lista de modelos que usam aquele recurso um determinado modelo. Op\u00E7\u00E3o acessada atrav\u00E9s do bot\u00E3o 'Excluir' na tela Recursos por Modelo.
recModel_Imprimir=Imprime sob forma de relatório com extensão .pdf o cadastro de consumo de recurso por modelo.
recModel_Incluir=Permite incluir um modelo na lista dos modelos que utilizam aquele recurso.

###############################################
#Recurso
###############################################
recurso_Buscar=Permite localiza\u00E7\u00E3o e visualiza\u00E7\u00E3o do recurso de produ\u00E7\u00E3o ou recursos de produ\u00E7\u00E3o de acordo com a busca realizada por c\u00F3digo ou descri\u00E7\u00E3o. Para utilizar esta op\u00E7\u00E3o basta informar o c\u00F3digo ou descri\u00E7\u00E3o desejados na caixa de di\u00E1logo e clicar no bot\u00E3o 'Buscar'.
recurso_Cadastro=Permite cadastrar/gerenciar os demais recursos de produção considerados críticos na empresa excetuando tecido e setor de costura que são tratados em cadastros separados.
recurso_Editar=Permite a edição dos campos relativos aos recursos selecionados.
recurso_Excluir=Permite exclus\u00E3o de um recurso do cadastro de recursos de produ\u00E7\u00E3o. Para acessar a op\u00E7\u00E3o clicar no bot\u00E3o 'Excluir' na tela de cadastro.
recurso_Imprimir=Imprime sob forma de relatório com extensão .pdf o cadastro de Recursos de Produção.
recurso_Incluir=Permite incluir os demais recursos de produção considerados críticos na empresa, excetuando tecido e setor de costura que são tratados em cadastro separados.
recurso_Mostrar=Permite mostrar os dados do Recurso de produção.

###############################################
#Tecido
###############################################
tecido_AlterarPercentualPerda=Permite edição do Percentual de Perda do Tecido.
tecido_Buscar=Permite localiza\u00E7\u00E3o e visualiza\u00E7\u00E3o do recurso de tecido/renda ou recursos de tecido/renda de acordo com a busca realizada por c\u00F3digo ou descri\u00E7\u00E3o. Para utilizar esta op\u00E7\u00E3o basta informar o c\u00F3digo ou descri\u00E7\u00E3o desejados na caixa de di\u00E1logo e clicar no bot\u00E3o 'Buscar'.
tecido_Cadastro=Esta tela tem como objetivo o cadastramento dos tecidos ou rendas considerados críticos e para os quais se deseja fazer uma avaliação de capacidade disponível considerando os planos de produção existentes. Nesta tela são informados além dos dados cadastrais dos tecidos as seguintes informações.
	tecido_FatorRendimento=Parâmetro de rendimento de cada tecido em metro por kilo. Permite que se calcule o consumo por lote em Kg, a partir da informação do consumo por lote em metros.
	tecido_LeadTimeU2=Informa o número aproximado em dias entre o momento em que deve iniciar a produção do tecido na Unidade 2 e o momento em que se deseja que o tecido esteja pronto.
	tecido_ProducaoDiariaMaxima=Informa ao sistema a capacidade máxima de produção diária em kg, daquele tecido na Unidade 2. Esta é uma severa restrição para a determinação da produção de modelos, pois não é uma variável sobre a qual se tenha flexibilidade.
	tecido_UM=Unidade de medida do recurso. No caso do tecido é metro e para renda é metro quadrado.
tecido_Editar=Permite alteração nos campos Descrição, UM, Lead Time U2, Fator de Rendimento e Prod. Diária Max. U2.
tecido_Excluir=Além de excluir o registro da tabela Tecido, deve também excluir o registro referente ao consumo do tecido para o modelo da tabela TecModel.
tecido_Imprimir=Imprime sob a forma de relatório com extensão .pdf o cadastro de tecido/renda.
tecido_Incluir=Além de incluir o registro referente ao tecido no cadastro tecidos, torna editáveis os campos: Código, Descrição do tecido, UM, Lead Time U2, Fator de rendimento e Prod. Diária Max. U2. A informação relativa a capacidade corresponde ao campo Prod. Diária Max. U2. Não é permitido a inclusão de tecido sem período cadastrado.
tecido_Mostrar=Permite mostrar os dados do Tecido/Renda.

###############################################
#Tecmodel
###############################################
tecmodel_Cadastro=Tem como objetivo permitir a edição do Consumo por lote em metros do Tecido/Renda e do Tempo de Defasagem do Uso do Tecido (em dias). O valor default para este último é o TR (Tempo de Reposição) do Modelo.
tecmodel_Editar=Permite informar o consumo do tecido por modelo através da edição dos campos: Consumo por lote em metros e o tempo de defasagem do uso do tecido.
tecmodel_Excluir=Exclui o modelo selecionado da lista de modelos que utilizam o tecido. Opção acessada a partir do botão 'Excluir'.
tecmodel_Imprimir=Imprime sob a forma de relatório com extensão .pdf o cadastro de tecido/renda.
tecmodel_Incluir=Permite informar a lista de modelos que utilizam um determinado tecido, relacionando o modelo como usuário do tecido. Torna editáveis os campos: Consumo por lote em metros e o tempo de defasagem do uso do tecido.

###############################################
#Usuário
###############################################
usuario_Cadastro=Permite gerenciar o cadastro de usuário.Para permitir o acesso do usuário ao sistema é necessário o seu cadastramentro prévio, definindo o login e o tipo do usuário. O cadastramento de usuários só pode ser feito por um usuário com status de Administrador.
usuario_Editar=As informações no cadastro de usuário são colocadas em edição para o usuário modificar os seus dados: nome, login e senha, para confirmar a alteração clique no botão alterar.
usuario_Excluir=As informações do usuário podem ser excluídas através do botão excluir que está no cadastro de usuário.
usuario_Incluir=Inclui o usuário no sistema. O usuário pode pertencer as seguintes categorias: aluno, gestor, administrador e engenheiro do conhecimento. Dependendo de sua categoria o usuário vai acessar um conjunto de telas e funções diferentes no sistema.
usuario_Imprimir=Imprime sob forma de relatório com extensão .pdf o cadastro de usuários.
usuario_Mostrar=Permite mostrar os dados de usuário.